# ── Taps ─────────────────────────────────────────────
tap "jesseduffield/lazygit"                   # source for the lazygit formula
tap "nikitabobko/tap"                         # source for the aerospace formula
tap "microsoft/inshellisense", "https://github.com/microsoft/inshellisense"  # source for inshellisense

# ── Core CLI utilities ───────────────────────────────
brew "coreutils"                              # GNU versions of core Unix commands (ls, cp, etc)
brew "fzf"                                    # fuzzy finder for files, history and more
brew "ripgrep"                                # fast recursive text search (rg)
brew "tree"                                   # print directory contents as a tree
brew "stow"                                   # symlink manager for dotfiles
brew "zoxide"                                 # smarter cd that learns your habits

# ── Shell & prompt ───────────────────────────────────
brew "starship"                               # cross-shell prompt
brew "zsh-syntax-highlighting"                # highlight commands as you type in zsh
brew "zsh-autosuggestions"                    # suggest commands from history as you type
brew "carapace"                               # multi-shell completion engine (carapace-bin)
brew "microsoft/inshellisense/inshellisense"  # IDE-style inline autocomplete (feeds from carapace)

# ── Development ──────────────────────────────────────
brew "neovim"                                 # modern Vim-based text editor
brew "node"                                   # Node.js runtime and npm
brew "mise"                                   # dev tool version manager (asdf replacement)
brew "ollama"                                 # run large language models locally
brew "aichat"                                 # LLM chat and tools from the terminal
brew "jesseduffield/lazygit/lazygit"          # terminal UI for git
cask "visual-studio-code"                     # code editor
cask "claude-code"                            # Anthropic's CLI coding agent
cask "taproom"                                # GUI to browse and manage Homebrew packages

# ── Containers ───────────────────────────────────────
cask "docker"                                 # container runtime and Desktop app
brew "devcontainer"                           # CLI to run VS Code dev containers

# ── Terminal & window management ─────────────────────
cask "kitty"                                  # GPU-accelerated terminal emulator
cask "nikitabobko/tap/aerospace"              # tiling window manager for macOS
cask "raycast"                                # launcher and productivity tool

# ── Fonts ────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"          # monospaced font with programming glyphs

# ── Browsers ─────────────────────────────────────────
cask "google-chrome"                          # web browser

# ── Productivity & communication ─────────────────────
cask "obsidian"                               # markdown note-taking app
cask "microsoft-teams"                        # team chat and video calls
cask "microsoft-outlook"                      # email and calendar client
