# ── Taps ─────────────────────────────────────────────
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"

# ── Core CLI utilities ───────────────────────────────
brew "coreutils"
brew "fzf"
brew "ripgrep"
brew "tree"
brew "stow"
brew "zoxide"

# ── Shell & prompt ───────────────────────────────────
brew "starship"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# ── Development ──────────────────────────────────────
brew "neovim"
brew "node"
brew "mise"
brew "ollama"
brew "aichat"
brew "jesseduffield/lazygit/lazygit"
cask "visual-studio-code"
cask "claude-code"
cask "taproom"

# ── Containers ───────────────────────────────────────
cask "docker"
brew "devcontainer"

# ── Terminal & window management ─────────────────────
cask "kitty"
cask "nikitabobko/tap/aerospace"
cask "raycast"

# ── Fonts ────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"

# ── Browsers ─────────────────────────────────────────
cask "google-chrome"

# ── Productivity & communication ─────────────────────
cask "obsidian"
cask "microsoft-teams"
cask "microsoft-outlook"
